{
"0": { "id": "48LawsOfPower", "type": "collection", "name": "The 48 Laws of Power", "description": "A comprehensive guide to understanding power dynamics, manipulation, and influence, based on Robert Greene's work." },
"1": { "id": "Law1", "type": "law", "name": "Never Outshine the Master", "description": "Always make those above you feel superior. Make your masters appear more brilliant than they are, and you will attain the heights of power." },
"2": { "id": "Law2", "type": "law", "name": "Never Put Too Much Trust in Friends, Learn How to Use Enemies", "description": "Friends will betray you faster than enemies. Use enemies to your advantage; they are more loyal out of necessity." },
"3": { "id": "Law3", "type": "law", "name": "Conceal Your Intentions", "description": "Always keep your intentions hidden. Use decoys and red herrings to mislead others." },
"4": { "id": "Law4", "type": "law", "name": "Always Say Less Than Necessary", "description": "Powerful people impress and intimidate by saying less. The more you say, the more likely you are to say something foolish." },
"5": { "id": "Law5", "type": "law", "name": "So Much Depends on Reputation - Guard It with Your Life", "description": "Your reputation is the cornerstone of your power. Protect it at all costs." },
"6": { "id": "Law6", "type": "law", "name": "Court Attention at All Costs", "description": "Stand out and create an aura of mystery to maintain your power." },
"7": { "id": "Law7", "type": "law", "name": "Get Others to Do the Work for You, but Always Take the Credit", "description": "Use the skills and effort of others while taking the credit to build your reputation." },
"8": { "id": "Law8", "type": "law", "name": "Make Other People Come to You - Use Bait if Necessary", "description": "Always make others come to you, using bait and manipulation to control their actions." },
"9": { "id": "Law9", "type": "law", "name": "Win Through Your Actions, Never Through Argument", "description": "Demonstrate your power through actions, not words. Arguments rarely convince others and often backfire." },
"10": { "id": "Law10", "type": "law", "name": "Infection: Avoid the Unhappy and Unlucky", "description": "Avoid associating with those who bring misfortune, as their negativity can infect you." },
"11": { "id": "Law11", "type": "law", "name": "Learn to Keep People Dependent on You", "description": "The more people depend on you, the greater your power. Create dependencies to remain indispensable." },
"12": { "id": "Law12", "type": "law", "name": "Use Selective Honesty and Generosity to Disarm Your Victim", "description": "Use small acts of honesty or generosity to disarm others and gain their trust." },
"13": { "id": "Law13", "type": "law", "name": "When Asking for Help, Appeal to People's Self-Interest, Never to Their Mercy", "description": "Frame your requests in terms of the other person's benefits to ensure cooperation." },
"14": { "id": "Law14", "type": "law", "name": "Pose as a Friend, Work as a Spy", "description": "Learn to gather information from others while maintaining the guise of friendship." },
"15": { "id": "Law15", "type": "law", "name": "Crush Your Enemy Totally", "description": "Do not leave any chance for your enemy to recover or retaliate. Total destruction ensures your safety." },
"16": { "id": "Law16", "type": "law", "name": "Use Absence to Increase Respect and Honor", "description": "Withdrawing temporarily makes your presence valued and respected." },
"17": { "id": "Law17", "type": "law", "name": "Keep Others in Suspended Terror: Cultivate an Air of Unpredictability", "description": "Unpredictability creates fear and confusion, keeping others off balance." },
"18": { "id": "Law18", "type": "law", "name": "Do Not Build Fortresses to Protect Yourself - Isolation is Dangerous", "description": "Stay connected and interact with others; isolation can make you vulnerable." },
"19": { "id": "Law19", "type": "law", "name": "Know Who You're Dealing With - Do Not Offend the Wrong Person", "description": "Understand the personalities and intentions of others to avoid unnecessary conflicts." },
"20": { "id": "Law20", "type": "law", "name": "Do Not Commit to Anyone", "description": "Maintain your independence and let others fight for your allegiance." },
"21": { "id": "Law21", "type": "law", "name": "Play a Sucker to Catch a Sucker - Seem Dumber Than Your Mark", "description": "Feign ignorance to make your opponents overconfident and easier to manipulate." },
"22": { "id": "Law22", "type": "law", "name": "Use the Surrender Tactic: Transform Weakness into Power", "description": "Surrender strategically to gain an advantage when you are weak." },
"23": { "id": "Law23", "type": "law", "name": "Concentrate Your Forces", "description": "Focus your resources on a single objective to maximize impact." },
"24": { "id": "Law24", "type": "law", "name": "Play the Perfect Courtier", "description": "Master the art of diplomacy and charm to navigate power dynamics." },
"25": { "id": "Law25", "type": "law", "name": "Re-Create Yourself", "description": "Shape your own identity and control how others perceive you." },
"26": { "id": "Law26", "type": "law", "name": "Keep Your Hands Clean", "description": "Avoid being associated with scandal or negative outcomes." },
"27": { "id": "Law27", "type": "law", "name": "Play on People's Need to Believe to Create a Cultlike Following", "description": "Exploit the human desire for meaning and belief to build loyalty." },
"28": { "id": "Law28", "type": "law", "name": "Enter Action with Boldness", "description": "Approach every endeavor with confidence and decisiveness." },
"29": { "id": "Law29", "type": "law", "name": "Plan All the Way to the End", "description": "Always think several steps ahead, anticipating obstacles and opportunities." },
"30": { "id": "Law30", "type": "law", "name": "Make Your Accomplishments Seem Effortless", "description": "Always conceal the effort and tricks behind your successes to appear naturally powerful." },
"31": { "id": "Law31", "type": "law", "name": "Control the Options: Get Others to Play with the Cards You Deal", "description": "Offer choices that benefit you no matter what others choose." },
"32": { "id": "Law32", "type": "law", "name": "Play to People's Fantasies", "description": "Feed people's fantasies and desires to gain influence over them." },
"33": { "id": "Law33", "type": "law", "name": "Discover Each Man's Thumbscrew", "description": "Identify others' weaknesses and vulnerabilities to exploit them." },
"34": { "id": "Law34", "type": "law", "name": "Be Royal in Your Own Fashion: Act Like a King to Be Treated Like One", "description": "Carry yourself with confidence and dignity to command respect." },
"35": { "id": "Law35", "type": "law", "name": "Master the Art of Timing", "description": "Understand the value of patience and strike at the perfect moment." },
"36": { "id": "Law36", "type": "law", "name": "Disdain Things You Cannot Have: Ignoring Them is the Best Revenge", "description": "By ignoring what you can't have, you diminish its power over you." },
"37": { "id": "Law37", "type": "law", "name": "Create Compelling Spectacles", "description": "Dramatic and impressive actions will captivate and dominate attention." },
"38": { "id": "Law38", "type": "law", "name": "Think as You Like, but Behave Like Others", "description": "Conform outwardly while maintaining your independence internally." },
"39": { "id": "Law39", "type": "law", "name": "Stir Up Waters to Catch Fish", "description": "Create chaos and confusion to make others act rashly." },
"40": { "id": "Law40", "type": "law", "name": "Despise the Free Lunch", "description": "Nothing is truly free; always pay your way to maintain independence." },
"41": { "id": "Law41", "type": "law", "name": "Avoid Stepping into a Great Man's Shoes", "description": "Establish your own identity instead of living in someone else's shadow." },
"42": { "id": "Law42", "type": "law", "name": "Strike the Shepherd and the Sheep Will Scatter", "description": "Remove influential figures to weaken their followers." },
"43": { "id": "Law43", "type": "law", "name": "Work on the Hearts and Minds of Others", "description": "Win people over through persuasion and emotional appeal." },
"44": { "id": "Law44", "type": "law", "name": "Disarm and Infuriate with the Mirror Effect", "description": "Imitate others to disarm or provoke them." },
"45": { "id": "Law45", "type": "law", "name": "Preach the Need for Change, but Never Reform Too Much at Once", "description": "Balance progress with stability to avoid backlash." },
"46": { "id": "Law46", "type": "law", "name": "Never Appear Too Perfect", "description": "Appear human and relatable to avoid envy and resentment." },
"47": { "id": "Law47", "type": "law", "name": "Do Not Go Past the Mark You Aimed For", "description": "Know when to stop and avoid unnecessary risks." },
"48": { "id": "Law48", "type": "law", "name": "Assume Formlessness", "description": "Be adaptable and unpredictable, never letting others pin you down." }
}
