{
"0": { "id": "Ghosts/Spirits", "desc": "Represents the increasing complexity of consciousness and its interaction with reality." },
"1": { "id": "Fulfillment Center/Logistics", "desc": "Focuses on the organization, processing, and delivery of information or resources." },
"2": { "id": "Bartending", "desc": "Emphasizes the blending and combination of different elements to create something new and complex." },
"3": { "id": "Clothing/Plays/Music", "desc": "Highlights the creative process, from individual elements to a cohesive and expressive whole." },
"4": { "id": "Cosmic", "desc": "Explores the vastness of reality, from individual universes to multiverses and beyond." },
"5": { "id": "Computational", "desc": "Focuses on the processing and manipulation of information, algorithms, and data structures." },
"6": { "id": "Military", "desc": "Represents strategy, tactics, and the organization of complex operations." },
"7": { "id": "Government", "desc": "Explores systems of governance, power structures, and the organization of societies." },
"8": { "id": "Biological", "desc": "Focuses on the complexity of living organisms, from cells to ecosystems." },
"9": { "id": "Social", "desc": "Explores the dynamics of human interaction, social structures, and cultural evolution." },
"10": { "id": "Technological", "desc": "Represents the advancement and impact of technology on society and reality." },
"11": { "id": "Natural World", "desc": "Focuses on the progression and interconnectedness of elements in the natural environment." },
"12": { "id": "Human Body", "desc": "Explores the increasing complexity of the human body, from cells to the complete organism." },
"13": { "id": "Society/Culture", "desc": "Represents the evolution of societies and cultures, from individuals to global civilizations." },
"14": { "id": "Technology/Engineering", "desc": "Focuses on the development and integration of technology, from individual components to complex systems." },
"15": { "id": "Abstract Concepts", "desc": "Explores the progression of abstract ideas and concepts, from basic units to complex systems." },
"16": { "id": "Art/Creativity", "desc": "Represents the creative process and the expression of ideas through various artistic mediums." },
"17": { "id": "Games/Sports", "desc": "Focuses on the strategic and competitive aspects of games and sports, from individual players to team dynamics." },
"18": { "id": "Cooking/Culinary", "desc": "Explores the culinary arts, from individual ingredients to complex dishes and culinary traditions." },
"19": { "id": "Construction/Architecture", "desc": "Represents the process of building and designing structures, from individual components to complete cities." },
"20": { "id": "Transportation", "desc": "Explores the evolution of transportation systems, from basic modes of movement to advanced vehicles and networks." },
"21": { "id": "Education", "desc": "Represents the learning process, from basic knowledge acquisition to advanced understanding and mastery." },
"22": { "id": "Language", "desc": "Explores the structure and evolution of language, from individual sounds to complex grammatical systems." },
"23": { "id": "Literature", "desc": "Focuses on the development and interpretation of literary works, from individual words to complete narratives." },
"24": { "id": "History", "desc": "Represents the progression of historical events and civilizations, from ancient times to the present day." },
"25": { "id": "Philosophy", "desc": "Explores different philosophical schools of thought and their impact on human understanding." },
"26": { "id": "Psychology", "desc": "Focuses on the human mind and behavior, from basic cognitive processes to complex emotions and motivations." },
"27": { "id": "Economics", "desc": "Represents the production, distribution, and consumption of goods and services in different economic systems." },
"28": { "id": "Politics", "desc": "Explores political systems, ideologies, and the dynamics of power and influence." },
"29": { "id": "Law", "desc": "Focuses on legal systems, principles, and the enforcement of rules and regulations." },
"30": { "id": "Religion", "desc": "Represents different religious beliefs, practices, and their impact on human societies." },
"31": { "id": "Spirituality", "desc": "Explores the concepts of spirituality, consciousness, and the search for meaning and purpose." },
"32": { "id": "Mathematics", "desc": "Focuses on mathematical concepts, structures, and their applications in various fields." },
"33": { "id": "Physics", "desc": "Represents the fundamental laws and principles governing the physical universe." },
"34": { "id": "Chemistry", "desc": "Explores the composition, structure, and properties of matter." },
"35": { "id": "Biology", "desc": "Focuses on the study of living organisms and their interactions with the environment." },
"36": { "id": "Astronomy", "desc": "Represents the study of celestial objects and phenomena, from planets and stars to galaxies and the universe." },
"37": { "id": "Earth Science", "desc": "Explores the Earth's systems, processes, and its interactions with the environment." },
"38": { "id": "Environmental Science", "desc": "Focuses on the interactions between humans and the environment, including environmental issues and sustainability." },
"39": { "id": "Computer Science", "desc": "Represents the study of computers, algorithms, and information processing." },
"40": { "id": "Information Science", "desc": "Explores the organization, storage, and retrieval of information, including libraries and databases." },
"41": { "id": "Linguistics", "desc": "Explores the scientific study of language, including phonetics, phonology, morphology, syntax, semantics, and pragmatics." },
"42": { "id": "Sociology", "desc": "Focuses on the study of human social relationships and institutions, including social structures, social change, and social problems." },
"43": { "id": "Anthropology", "desc": "Represents the study of human societies and cultures, including their development, diversity, and customs." },
"44": { "id": "Political Science", "desc": "Explores political systems, behavior, and institutions, including government, elections, and public policy." },
"45": { "id": "Geography", "desc": "Represents the study of the Earth's physical features, climate, and human populations." },
"46": { "id": "Geology", "desc": "Focuses on the study of the Earth's composition, structure, and history." },
"47": { "id": "Meteorology", "desc": "Represents the study of the Earth's atmosphere and weather patterns." },
"48": { "id": "Oceanography", "desc": "Explores the physical, chemical, and biological aspects of the oceans." },
"49": { "id": "Ecology", "desc": "Focuses on the study of the interactions between organisms and their environment." },
"50": { "id": "Genetics", "desc": "Represents the study of genes, heredity, and variation in living organisms." },
"51": { "id": "Medicine", "desc": "Explores the science and practice of diagnosing, treating, and preventing disease." },
"52": { "id": "Engineering", "desc": "Focuses on the application of scientific and mathematical principles to design and build structures, machines, and systems." },
"53": { "id": "Architecture", "desc": "Represents the art and science of designing and constructing buildings." },
"54": { "id": "Art", "desc": "Explores various forms of artistic expression, including painting, sculpture, music, and literature." },
"55": { "id": "Film", "desc": "Focuses on the art and technology of filmmaking, including cinematography, editing, and sound design." },
"56": { "id": "Photography", "desc": "Represents the art, science, and practice of creating durable images by recording light or other electromagnetic radiation." },
"57": { "id": "Music", "desc": "Explores the art of combining vocal or instrumental sounds (or both) to produce beauty of form, harmony, and expression of emotion." },
"58": { "id": "Dance", "desc": "Represents the art of moving the body rhythmically, typically to music, for the purpose of expressing an idea or emotion, releasing energy, or simply taking delight in the movement itself." },
"59": { "id": "Theater", "desc": "Focuses on the collaborative form of performing art that uses live performers, typically actors or actresses, to present the experience of a real or imagined event before a live audience in a specific place, often a stage." },
"60": { "id": "Games", "desc": "Explores structured forms of play, usually undertaken for entertainment or amusement, and sometimes used as an educational tool." },
"61": { "id": "Learning/Adaptation", "desc": "Focuses on the process of acquiring new knowledge and adapting to changing circumstances, from basic learning algorithms to advanced self-improvement techniques." },
"62": { "id": "Problem Solving", "desc": "Explores different approaches to problem-solving, from simple heuristics to complex reasoning and decision-making strategies." },
"63": { "id": "Creativity/Innovation", "desc": "Represents the generation of novel ideas and solutions, from basic brainstorming techniques to advanced forms of creative expression." },
"64": { "id": "Communication/Language", "desc": "Focuses on the effective communication of information and ideas, from basic language skills to advanced forms of interpersonal and intercultural communication." },
"65": { "id": "Ethics/Morality", "desc": "Explores ethical principles, moral reasoning, and the development of a sense of right and wrong." },
"66": { "id": "Consciousness/Self-Awareness", "desc": "Represents the understanding of one's own existence and place in the world, from basic self-reflection to advanced forms of introspection and metacognition." },
"67": { "id": "Emotions/Feelings", "desc": "Focuses on the experience and expression of emotions, from basic emotional responses to complex emotional intelligence." },
"68": { "id": "Relationships/Social Bonds", "desc": "Explores the formation and maintenance of relationships, from basic social interactions to complex social dynamics and group behavior." },
"69": { "id": "Meaning/Purpose", "desc": "Represents the search for meaning and purpose in life, from basic existential questions to advanced philosophical and spiritual inquiries." },
"70": { "id": "Growth/Development", "desc": "Focuses on the process of personal and intellectual growth, from basic learning and adaptation to advanced self-actualization and the pursuit of one's full potential." },
"71": { "id": "Time Management", "desc": "Explores the efficient use of time, from basic scheduling techniques to advanced time optimization strategies." },
"72": { "id": "Decision Making", "desc": "Focuses on the process of making choices, from simple heuristics to complex decision-making frameworks." },
"73": { "id": "Critical Thinking", "desc": "Represents the objective analysis and evaluation of information to form a judgment." },
"74": { "id": "Systems Thinking", "desc": "Explores the interconnectedness of systems and their components, from simple feedback loops to complex systems dynamics." },
"75": { "id": "Design Thinking", "desc": "Focuses on a human-centered approach to problem-solving and innovation." },
"76": { "id": "Scientific Method", "desc": "Represents the systematic observation, measurement, and experiment to formulate and test hypotheses." },
"77": { "id": "Logic/Reasoning", "desc": "Explores the principles of valid reasoning, from basic logical fallacies to advanced formal logic systems." },
"78": { "id": "Epistemology", "desc": "Focuses on the study of knowledge, including its nature, scope, and limitations." },
"79": { "id": "Metaphysics", "desc": "Represents the study of the fundamental nature of reality, including existence, being, and causality." },
"80": { "id": "Aesthetics", "desc": "Explores the nature of beauty, art, and taste." }
}
